live/05_files/task_sequence_storage_ina_file.org
#+TITLE:  Sequence storage in a file

* Task

Write a new version of the previous task. There should be two
differences. 1) Read the data from a file
http://baloo-dev.cbrc.kaust.edu.sa/live/05_files/seq.tab
and 2) use subroutines to create logical groups of statements. Use
short descriptive subroutine names.

See the sample code for the previous task:
http://baloo-dev.cbrc.kaust.edu.sa/live/04_refs_complex_structures/task_sequence_storage.pl

* Sample solution

#+HEADERS: :results output :exports both :shebang "#!/usr/bin/env perl"
#+BEGIN_SRC perl :tangle file_sub.pl
  use v5.10;
  use strict;
  use warnings;
  use autodie;
  use Data::Dumper; # Data::Printer 
  my $DEBUG = 1;
  
  
  sub parse_line {
      my $line = shift;
      #say;
      my ($id, $descr, $seq) = split "\t", $line;
      say "($id, $descr, $seq)" if $DEBUG;
      
      # building  a hash 
      
      my %this_seq;
      $this_seq{id} = $id;
      $this_seq{descr} = $descr;
      $this_seq{seq} = $seq;
      print Dumper \%this_seq;
  
      # returning a reference to this hash
      return \%this_seq;
  }
  
  
  sub read_file {
      my $file = shift;
      # create the data structure to hold sequence information
      my $seqs;
      # open the file
      open my $F, "<", $file;
      while (<$F>) {
          chomp;
          my $new_seq = parse_line($_);
          $seqs->{$new_seq->{id}} = $new_seq;
          #print Dumper $seqs;
      }
      return $seqs;
  }
  
  
  # main part of the programme
  my $file = 'seq.tab';
  my $seqs = read_file($file);
  
  # call information from the data structure
  say $seqs->{A7A179}->{descr};
#+END_SRC

#+RESULTS:
#+begin_example
(Q4X180, Putative lipase atg15, MKSSRKRTKRR)
$VAR1 = {
          'id' => 'Q4X180',
          'seq' => 'MKSSRKRTKRR',
          'descr' => 'Putative lipase atg15'
        };
(A7A179, Sterol 3-beta-glucosyltransferase, MPITQIISASD)
$VAR1 = {
          'id' => 'A7A179',
          'seq' => 'MPITQIISASD',
          'descr' => 'Sterol 3-beta-glucosyltransferase'
        };
(Q8S929, Cysteine protease ATG4a, MKALCDRFVPQ)
$VAR1 = {
          'id' => 'Q8S929',
          'seq' => 'MKALCDRFVPQ',
          'descr' => 'Cysteine protease ATG4a'
        };
Sterol 3-beta-glucosyltransferase
#+end_example

