live/05_files/task_sequence_storage_ina_file.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Sequence storage in a file</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Sequence storage in a file"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-25T08:58+0300"/>
<meta name="author" content="Heikki Lehvaslaiho"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Sequence storage in a file</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Task</a></li>
<li><a href="#sec-2">2 Sample solution</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Task</h2>
<div class="outline-text-2" id="text-1">


<p>
Write a new version of the previous task. There should be two
differences. 1) Read the data from a file
<a href="http://baloo-dev.cbrc.kaust.edu.sa/live/05_files/seq.tab">http://baloo-dev.cbrc.kaust.edu.sa/live/05_files/seq.tab</a>
and 2) use subroutines to create logical groups of statements. Use
short descriptive subroutine names.
</p>
<p>
See the sample code for the previous task:
<a href="http://baloo-dev.cbrc.kaust.edu.sa/live/04_refs_complex_structures/task_sequence_storage.pl">http://baloo-dev.cbrc.kaust.edu.sa/live/04_refs_complex_structures/task_sequence_storage.pl</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Sample solution</h2>
<div class="outline-text-2" id="text-2">





<pre class="example">use v5.10;
use strict;
use warnings;
use autodie;
use Data::Dumper; # Data::Printer 
my $DEBUG = 1;


sub parse_line {
    my $line = shift;
    #say;
    my ($id, $descr, $seq) = split "\t", $line;
    say "($id, $descr, $seq)" if $DEBUG;

    # building  a hash 

    my %this_seq;
    $this_seq{id} = $id;
    $this_seq{descr} = $descr;
    $this_seq{seq} = $seq;
    print Dumper \%this_seq;

    # returning a reference to this hash
    return \%this_seq;
}


sub read_file {
    my $file = shift;
    # create the data structure to hold sequence information
    my $seqs;
    # open the file
    open my $F, "&lt;", $file;
    while (&lt;$F&gt;) {
        chomp;
        my $new_seq = parse_line($_);
        $seqs-&gt;{$new_seq-&gt;{id}} = $new_seq;
        #print Dumper $seqs;
    }
    return $seqs;
}


# main part of the programme
my $file = 'seq.tab';
my $seqs = read_file($file);

# call information from the data structure
say $seqs-&gt;{A7A179}-&gt;{descr};
</pre>



<pre class="example">(Q4X180, Putative lipase atg15, MKSSRKRTKRR)
$VAR1 = {
          'id' =&gt; 'Q4X180',
          'seq' =&gt; 'MKSSRKRTKRR',
          'descr' =&gt; 'Putative lipase atg15'
        };
(A7A179, Sterol 3-beta-glucosyltransferase, MPITQIISASD)
$VAR1 = {
          'id' =&gt; 'A7A179',
          'seq' =&gt; 'MPITQIISASD',
          'descr' =&gt; 'Sterol 3-beta-glucosyltransferase'
        };
(Q8S929, Cysteine protease ATG4a, MKALCDRFVPQ)
$VAR1 = {
          'id' =&gt; 'Q8S929',
          'seq' =&gt; 'MKALCDRFVPQ',
          'descr' =&gt; 'Cysteine protease ATG4a'
        };
Sterol 3-beta-glucosyltransferase
</pre>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-25T08:58+0300</p>
<p class="author">Author: Heikki Lehvaslaiho</p>
<p class="creator">Org version 7.8.06 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
